//Точка входа консольного приложения Алисы
using namespace std;//Чтобы не указывать это явно перед каждой функцией.

#include "common_header.h"	//Файл с функциями и константами,
				//одинаковыми и для Алисы, и для Боба
//---------------------------------------
//Глобальные переменные и константы

//---------------------------------------
//Прототипы функций
	#include "common.cpp"

//---------------------------------------
//Точка входа
int main( void )
{
	while ( true )	//Самый внешний цикл - заставляет повториться всю программу,
					//если что-то пошло не так
	try
	{
		NetWork bob("localhost", 50000);
		
		//Теперь создадим цикл, в котором будем крутить основной алгоритм
		//работы
		bool work_flag = true;
		while ( work_flag )//рабочий цикл
		{
			cout << "alice: Successfully connected with Bob" << endl;
			break;
		}//end рабочий цикл

		break;
	}//end Внешний цикл
	catch (int errno)
	{
		std::cerr << strerror(errno) << std::endl;
	};
	return EXIT_SUCCESS;
}//end main()

//--------------------------------------------------
//Определения функций Алисы
