//Точка входа консольного приложения Алисы

#include "common_header.h"
//Файл с функциями и компонентами, одинаковыми и для Алисы, и для Боба

//---------------------------------------
//Глобальные переменные и константы

//---------------------------------------
//Прототипы функций
#include "common.cpp"

//---------------------------------------
//Точка входа
int main( void )
{
	while ( true )
	//Самый внешний цикл - заставляет повториться всю программу,
	//если что-то пошло не так
	{
		try
		{		
			NetWork server( 3, 50000 );
			
			while (!server.IsReady(peers::alice)) sleep(1);
			
			//Теперь создадим цикл, в котором будем крутить основной алгоритм работы
			bool work_flag = true;
			while ( work_flag )//рабочий цикл
			{
				std::cout << "bob: Successfully connected with Alice" << std::endl;
				break;
			}//end рабочий цикл
			
			//Не забываем закрыть все соединения
			break;
		} catch (int errno)
		{
			std::cerr << strerror(errno) << std::endl;
		}

	}//end Внешний цикл
	
}//end main()

//--------------------------------------------------
//Определения функций Боба
