//Коды ошибок
	#define CANNOT_CREATE_SOCKET
	#define CANNOT_CONNECT
	#define CANNOT_SEND

//-------------------------------------------------------------------
//Общие константы
	//Чтобы отличить отправителя от получателя
		enum device
		{
			bob,
			alice,
			GUI
		};
  
  //Перечисление режимов работы
  enum regimes_list
  {
    generation,//Режим генерации ключа

    regime_Illegal //Для создания массивов и контроля ошибок
  };

//-------------------------------------------------------------------
//Общие типы данных и структуры
	//Данная структура предназначена для обмена между Алисой и Бобом
	//отсчётами, на которых было срабатывание детектора
		struct detections
		{
			vector<bool> basis;//Базис
			vector<bool> key;
			//Значение ключа в данном отсчёта
			vector<bool> special;
			//Для вычисления QBER или чего-нибудь странного

			vector<unsigned int> count;
			//Число временных отсчётов от предыдущего срабатывания
		};

//-------------------------------------------------------------------
//Общие функции
	//Сохраняет текущую конфигурацию config в энергонезависимую память
		void save_config()
		{
			ofstream file( "configuration.bin", ios::binary );
			file.write( (char *) &config, sizeof( config ));
			file.close();
		}
